devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
/*==============================================================================
File    can.c

Author  Daniel Zorychta

Brief   CAN driver

        Copyright (C) 2020 Daniel Zorychta <daniel.zorychta@gmail.com>

        This program is free software; you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation and modified by the dnx RTOS exception.

        NOTE: The modification  to the GPL is  included to allow you to
              distribute a combined work that includes dnx RTOS without
              being obliged to provide the source  code for proprietary
              components outside of the dnx RTOS.

        The dnx RTOS  is  distributed  in the hope  that  it will be useful,
        but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
        MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
        GNU General Public License for more details.

        Full license text is available on the following file: doc/license.txt.

==============================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32fx/can_cfg.h"
#include "../can_ioctl.h"

#if defined(ARCH_stm32f1)
#include "stm32f1/stm32f10x.h"
#elif defined(ARCH_stm32f3)
#include "stm32f3/stm32f3xx.h"
#elif defined(ARCH_stm32f4)
#include "stm32f4/stm32f4xx.h"
#elif defined(ARCH_stm32f7)
#include "stm32f7/stm32f7xx.h"
#include "stm32f7/lib/stm32f7xx_ll_rcc.h"
#endif

/*==============================================================================
  Local macros
==============================================================================*/
#define TX_MAILBOXES            3
#define RX_MAILBOXES            2
#define RX_FIFO_DEPTH           3
#define INIT_TIMEOUT            1000
#define MTX_TIMEOUT             1000

#if defined(ARCH_stm32f1)
#if defined(STM32F10X_LD) || defined(STM32F10X_MD) || defined(STM32F10X_HD)\
 || defined(STM32F10X_XL)
#define CAN1_TX_IRQN            USB_HP_CAN1_TX_IRQn
#define CAN1_RX0_IRQN           USB_LP_CAN1_RX0_IRQn
#define CAN1_TX_IRQHANDLER      USB_HP_CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     USB_LP_CAN1_RX0_IRQHandler
#define FILTERS_COUNT           14
#endif

#ifdef STM32F10X_CL
#define CAN1_TX_IRQN            CAN1_TX_IRQn
#define CAN1_RX0_IRQN           CAN1_RX0_IRQn
#define CAN1_TX_IRQHANDLER      CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     CAN1_RX0_IRQHandler
#define FILTERS_COUNT           28
#endif
#endif

#if defined(ARCH_stm32f3)
#define CAN1_TX_IRQN            CAN_TX_IRQn
#define CAN1_RX0_IRQN           CAN_RX0_IRQn
#define CAN1_TX_IRQHANDLER      USB_HP_CAN_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     USB_LP_CAN_RX0_IRQHandler
#define CAN1_RX1_IRQHandler     CAN_RX1_IRQHandler
#define CAN1_SCE_IRQHandler     CAN_SCE_IRQHandler
#define FILTERS_COUNT           14
#define RCC_APB1ENR_CAN1EN      RCC_APB1ENR_CANEN
#define RCC_APB1RSTR_CAN1RST    RCC_APB1RSTR_CANRST
#define RCC_APB1RSTR_CAN1RST    RCC_APB1RSTR_CANRST
#define CAN1                    CAN
#define CAN1_RX1_IRQn           CAN_RX1_IRQn
#define CAN1_SCE_IRQn           CAN_SCE_IRQn
#endif

#if defined(ARCH_stm32f4)
#define CAN1_TX_IRQN            CAN1_TX_IRQn
#define CAN1_RX0_IRQN           CAN1_RX0_IRQn
#define CAN1_TX_IRQHANDLER      CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     CAN1_RX0_IRQHandler
#define FILTERS_COUNT           28
#endif

#if defined(ARCH_stm32f7)
#define CAN1_TX_IRQN            CAN1_TX_IRQn
#define CAN1_RX0_IRQN           CAN1_RX0_IRQn
#define CAN1_TX_IRQHANDLER      CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     CAN1_RX0_IRQHandler
#define FILTERS_COUNT           28
#endif

/*==============================================================================
  Local object types
==============================================================================*/
typedef struct {
        u32_t    send_timeout;
        u32_t    recv_timeout;
        u32_t    txpend_ctr;
        u32_t    rxpend_ctr;
        mutex_t *config_mtx;
        mutex_t *txmbox_mtx[TX_MAILBOXES];
        queue_t *txrdy_q[TX_MAILBOXES];
        queue_t *rxqueue_q;
} CAN_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static void relese_resources(CAN_t *hdl);
static int configure(CAN_t *hdl, const CAN_config_t *cfg);
static int set_init_mode(CAN_t *hdl);
static int set_normal_mode(CAN_t *hdl);
static int set_sleep_mode(CAN_t *hdl);
static int set_filter(CAN_t *hdl, const CAN_filter_t *filter);
static int disable_filter(CAN_t *hdl, u32_t filter);
static int send_msg(CAN_t *hdl, const CAN_msg_t *msg, u32_t timeout_ms);
static int recv_msg(CAN_t *hdl, CAN_msg_t *msg, u32_t timeout_ms);

/*==============================================================================
  Local object
==============================================================================*/
MODULE_NAME(CAN);

static CAN_t *CAN_hdl;

/*==============================================================================
  Exported object
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device.
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 * @param[in ]            config               optional module configuration
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_INIT(CAN, void **device_handle, u8_t major, u8_t minor, const void *config)
{
        int err = EINVAL;

        if (major == 0 && minor == 0) {

                err = sys_zalloc(sizeof(CAN_t), device_handle);
                if (!err) {

                        CAN_t *hdl = *device_handle;

                        hdl->recv_timeout = MAX_DELAY_MS;
                        hdl->send_timeout = 0;

                        err = sys_mutex_create(MUTEX_TYPE_RECURSIVE, &hdl->config_mtx);
                        if (err) {
                                goto finish;
                        }

                        err = sys_queue_create(RX_MAILBOXES * RX_FIFO_DEPTH,
                                               sizeof(CAN_FIFOMailBox_TypeDef),
                                               &hdl->rxqueue_q);
                        if (err) {
                                goto finish;
                        }

                        for (int i = 0; i < TX_MAILBOXES; i++) {
                                err = sys_mutex_create(MUTEX_TYPE_NORMAL, &hdl->txmbox_mtx[i]);
                                if (err) {
                                        goto finish;
                                }

                                err = sys_queue_create(1, sizeof(int), &hdl->txrdy_q[i]);
                                if (err) {
                                        goto finish;
                                }
                        }

