devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
        static const u32_t CAN_TSR_TXOK[TX_MAILBOXES] = {CAN_TSR_TXOK0,
                                                         CAN_TSR_TXOK1,
                                                         CAN_TSR_TXOK2};

        for (int i = 0; i < TX_MAILBOXES; i++) {

                if (CAN1->TSR & CAN_TSR_RQCP[i]) {

                        int err = EIO;

                        if (CAN1->TSR & CAN_TSR_TERR[i]) {
                                err = EIO;
                        } else if (CAN1->TSR & CAN_TSR_ALST[i]) {
                                err = EAGAIN;
                        } else if (CAN1->TSR & CAN_TSR_TXOK[i]) {
                                err = ESUCC;
                        }

                        SET_BIT(CAN1->TSR, CAN_TSR_RQCP[i]);

                        bool woken = false;
                        sys_queue_send_from_ISR(CAN_hdl->txrdy_q[i], &err, &woken);

                        yield |= woken;
                }
        }

        sys_thread_yield_from_ISR(yield);
}

//==============================================================================
/**
 * @brief CAN FIFO0 Rx IRQ.
 */
//==============================================================================
void CAN1_RX0_IRQHANDLER(void)
{
        bool yield = false;

        sys_queue_send_from_ISR(CAN_hdl->rxqueue_q, &CAN1->sFIFOMailBox[0], &yield);

        SET_BIT(CAN1->RF0R, CAN_RF0R_RFOM0);

        sys_thread_yield_from_ISR(yield);
}

//==============================================================================
/**
 * @brief CAN FIFO1 Rx IRQ.
 */
//==============================================================================
void CAN1_RX1_IRQHandler(void)
{
        bool yield = false;

        sys_queue_send_from_ISR(CAN_hdl->rxqueue_q, &CAN1->sFIFOMailBox[1], &yield);

        SET_BIT(CAN1->RF1R, CAN_RF0R_RFOM0);

        sys_thread_yield_from_ISR(yield);
}

//==============================================================================
/**
 * @brief Bus change IRQ.
 */
//==============================================================================
void CAN1_SCE_IRQHandler(void)
{

}

/*==============================================================================
  End of file
==============================================================================*/
